airbnb-app/app/controllers/cities_controller.rb

SELECT "cities".* FROM "cities"
---
  def index
    @cities = City.all

INSERT INTO "cities" ("country", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["country", "United States"], ["created_at", "2020-04-06 23:52:12.588327"], ["updated_at", "2020-04-06 23:52:12.588327"]]
---
  def create
    @city = City.new(city_params)

    if @city.save

SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_city
      @city = City.find(params[:id])