airbnb-app/app/controllers/properties_controller.rb

SELECT "cities".* FROM "cities" WHERE "cities"."name" = $1 LIMIT $2  [["name", "New York"], ["LIMIT", 1]]
SELECT "properties".* FROM "properties" WHERE "properties"."city_id" = $1  [["city_id", 37]]
SELECT "properties".* FROM "properties"
---
  def index
    @city = City.find_by(name: params[:city_id])

    @cityWithProperties = Property.where(city_id: @city.id)

    @properties = Property.all

INSERT INTO "properties" ("address", "zipcode", "user_id", "city_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["address", "dsdad"], ["zipcode", "adasd"], ["user_id", 19], ["city_id", 39], ["created_at", "2020-04-14 15:59:32.048867"], ["updated_at", "2020-04-14 15:59:32.048867"]]
---
  def create
    @property = Property.new(property_params)
    @property.user_id = @current_user.id

    if @property.save

UPDATE "properties" SET "address" = $1, "zipcode" = $2, "updated_at" = $3 WHERE "properties"."id" = $4  [["address", "99 University Plaza, Suite 100 PMB 1053"], ["zipcode", "07600"], ["updated_at", "2020-04-09 19:58:30.925856"], ["id", 7]]
---
  def update
    if @property.update(property_params)

DELETE FROM "properties" WHERE "properties"."id" = $1  [["id", 27]]
---
  def destroy
    @property.destroy

SELECT "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
    def set_property
      @property = Property.find(params[:id])